In [1]:
import numpy as np

In [2]:
import pandas as pd

In [ ]:
# pandas series

In [4]:
my_list = [1,2,3]
labels = ['a','b','c']
ser1 = pd.Series(my_list,labels)

In [5]:
ser1

a    1
b    2
c    3
dtype: int64

In [6]:
ser2 = pd.Series([1,2,3,4],['India','USA','UAE','Nepal'])

In [7]:
ser2

India    1
USA      2
UAE      3
Nepal    4
dtype: int64

In [8]:
ser3 = pd.Series([1,2,5,4],['India','USA','Italy','Nepal'])

In [9]:
ser3

India    1
USA      2
Italy    5
Nepal    4
dtype: int64

In [10]:
ser2 + ser3

India    2.0
Italy    NaN
Nepal    8.0
UAE      NaN
USA      4.0
dtype: float64

In [11]:
# pandas DataFrames

In [12]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [13]:
df

          W         X         Y         Z
A  1.586408  0.484838 -0.556055 -0.873210
B  1.815619 -0.415782 -0.039850  1.325176
C  0.463716  1.064589 -1.541026  0.170326
D  0.825539 -0.873078  0.692158  0.892086
E  0.969283  0.153597 -0.654708  1.421821

In [18]:
df['W']

A    1.586408
B    1.815619
C    0.463716
D    0.825539
E    0.969283
Name: W, dtype: float64

In [19]:
df['new'] = df['W'] + df['Y']

In [20]:
df['new']

A    1.030353
B    1.775769
C   -1.077310
D    1.517697
E    0.314575
Name: new, dtype: float64

In [21]:
df

          W         X         Y         Z       new
A  1.586408  0.484838 -0.556055 -0.873210  1.030353
B  1.815619 -0.415782 -0.039850  1.325176  1.775769
C  0.463716  1.064589 -1.541026  0.170326 -1.077310
D  0.825539 -0.873078  0.692158  0.892086  1.517697
E  0.969283  0.153597 -0.654708  1.421821  0.314575

In [22]:
df.drop('new',axis=1) # axis 1 means it refers to the columns

          W         X         Y         Z
A  1.586408  0.484838 -0.556055 -0.873210
B  1.815619 -0.415782 -0.039850  1.325176
C  0.463716  1.064589 -1.541026  0.170326
D  0.825539 -0.873078  0.692158  0.892086
E  0.969283  0.153597 -0.654708  1.421821

In [27]:
df.drop('E',axis=0) # by default axis=0 means it refers to the rows

          W         X         Y         Z       new
A  1.586408  0.484838 -0.556055 -0.873210  1.030353
B  1.815619 -0.415782 -0.039850  1.325176  1.775769
C  0.463716  1.064589 -1.541026  0.170326 -1.077310
D  0.825539 -0.873078  0.692158  0.892086  1.517697

In [28]:
df.drop('new',axis=1,inplace=True) # inplace is used to delete column in actual dataframe

In [29]:
df # now new has been droped successfully

          W         X         Y         Z
A  1.586408  0.484838 -0.556055 -0.873210
B  1.815619 -0.415782 -0.039850  1.325176
C  0.463716  1.064589 -1.541026  0.170326
D  0.825539 -0.873078  0.692158  0.892086
E  0.969283  0.153597 -0.654708  1.421821

In [30]:
df.shape

(5, 4)

In [31]:
# selecting rows

In [32]:
df.loc['E'] # method one to select a row E

W    0.969283
X    0.153597
Y   -0.654708
Z    1.421821
Name: E, dtype: float64

In [33]:
df.iloc[4] # method two to select a row E

W    0.969283
X    0.153597
Y   -0.654708
Z    1.421821
Name: E, dtype: float64

In [34]:
# selecting subsets of dataframe

In [35]:
df.loc['A','Y']

-0.5560549676995565

In [36]:
df.loc[['A','B'],['W','Z']]

          W         Z
A  1.586408 -0.873210
B  1.815619  1.325176

In [37]:
# conditional checking

In [38]:
df > 0

      W      X      Y      Z
A  True   True  False  False
B  True  False  False   True
C  True   True  False   True
D  True  False   True   True
E  True   True  False   True

In [40]:
bool_df = df>0

In [41]:
df[bool_df]

          W         X         Y         Z
A  1.586408  0.484838       NaN       NaN
B  1.815619       NaN       NaN  1.325176
C  0.463716  1.064589       NaN  0.170326
D  0.825539       NaN  0.692158  0.892086
E  0.969283  0.153597       NaN  1.421821

In [42]:
df[df>0]

          W         X         Y         Z
A  1.586408  0.484838       NaN       NaN
B  1.815619       NaN       NaN  1.325176
C  0.463716  1.064589       NaN  0.170326
D  0.825539       NaN  0.692158  0.892086
E  0.969283  0.153597       NaN  1.421821

In [47]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [48]:
df[df['X']>0]

          W         X         Y         Z
A  1.586408  0.484838 -0.556055 -0.873210
C  0.463716  1.064589 -1.541026  0.170326
E  0.969283  0.153597 -0.654708  1.421821

In [51]:
resultdf = df[df['Z']>0]

In [52]:
resultdf

          W         X         Y         Z
B  1.815619 -0.415782 -0.039850  1.325176
C  0.463716  1.064589 -1.541026  0.170326
D  0.825539 -0.873078  0.692158  0.892086
E  0.969283  0.153597 -0.654708  1.421821

In [54]:
resultdf['X']

B   -0.415782
C    1.064589
D   -0.873078
E    0.153597
Name: X, dtype: float64

In [55]:
# same thing in one line

In [56]:
df[df['Z']>0]['X']

B   -0.415782
C    1.064589
D   -0.873078
E    0.153597
Name: X, dtype: float64

In [57]:
df[df['Z']>0][['Y','X']] #grabing multiple columns

          Y         X
B -0.039850 -0.415782
C -1.541026  1.064589
D  0.692158 -0.873078
E -0.654708  0.153597

In [58]:
# same thing in steps
boolser = df['Z']>0
result = df[boolser]
my_cols = ['Y','X']
result[my_cols]

          Y         X
B -0.039850 -0.415782
C -1.541026  1.064589
D  0.692158 -0.873078
E -0.654708  0.153597

In [59]:
# DUAL conditions

df[(df['Z']>0) and df['X']>1] # this line code is wrong for doing multiple condition checking we have to use & for and , and | for or

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [65]:
df[(df['Z']>0) & df['X'] < 1]

          W         X         Y        Z
A  1.586408  0.484838 -0.556055 -0.87321

In [66]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.586408  0.484838 -0.556055 -0.873210
1     B  1.815619 -0.415782 -0.039850  1.325176
2     C  0.463716  1.064589 -1.541026  0.170326
3     D  0.825539 -0.873078  0.692158  0.892086
4     E  0.969283  0.153597 -0.654708  1.421821

In [67]:
newind = 'IND USA AUS CAN RUS'.split()

In [70]:
df['states'] = newind

In [71]:
df

          W         X         Y         Z states
A  1.586408  0.484838 -0.556055 -0.873210    IND
B  1.815619 -0.415782 -0.039850  1.325176    USA
C  0.463716  1.064589 -1.541026  0.170326    AUS
D  0.825539 -0.873078  0.692158  0.892086    CAN
E  0.969283  0.153597 -0.654708  1.421821    RUS

In [73]:
df.set_index('states')

               W         X         Y         Z
states
IND     1.586408  0.484838 -0.556055 -0.873210
USA     1.815619 -0.415782 -0.039850  1.325176
AUS     0.463716  1.064589 -1.541026  0.170326
CAN     0.825539 -0.873078  0.692158  0.892086
RUS     0.969283  0.153597 -0.654708  1.421821

In [74]:
# multiple index

In [76]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [77]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [78]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [79]:
df

             A         B
G1 1  0.247409  0.476180
   2  1.736273  0.337064
   3 -0.763533  0.189873
G2 1  0.766565  0.545935
   2 -0.375359  1.603116
   3 -0.188228 -1.106130

In [80]:
df.loc['G1']

          A         B
1  0.247409  0.476180
2  1.736273  0.337064
3 -0.763533  0.189873

In [83]:
df.loc['G2'].loc[1]

A    0.766565
B    0.545935
Name: 1, dtype: float64

In [89]:
df.loc['G2'].loc[2]['A']

-0.37535857025519603

In [85]:
df.index.names = ['Groups','Num']

In [86]:
df

                   A         B
Groups Num
G1     1    0.247409  0.476180
       2    1.736273  0.337064
       3   -0.763533  0.189873
G2     1    0.766565  0.545935
       2   -0.375359  1.603116
       3   -0.188228 -1.106130

In [87]:
df.xs('G1')

            A         B
Num
1    0.247409  0.476180
2    1.736273  0.337064
3   -0.763533  0.189873

In [88]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.247409  0.476180
G2      0.766565  0.545935

In [91]:
d1 = { 'A':['A0','A1','A2'],
        'B':['B0','B1','B2'],
        'C':['C0','C1','C2']
       }
df1 = pd.DataFrame(d1)

In [92]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [93]:
d2 = { 'A':['A3','A4','A5'],
        'B':['B3','B4','B5'],
        'C':['C3','C4','C5']
       }
df2 = pd.DataFrame(d2,[3,4,5])

In [94]:
df2

    A   B   C
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [98]:
pd.concat([df1,df2],axis=0)

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [111]:
left = {
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2'],
    'C':['C0','C1','C2'],
    'Key':[0,1,2]
}

right = {
    'A':['A3','A4','A5'],
    'B':['B3','B4','B5'],
    'C':['C3','C4','C5'],
    'Key':[0,1,2]
}

In [108]:
lef = pd.DataFrame(left)
rig = pd.DataFrame(right)

In [109]:
lef

    A   B   C  Key
0  A0  B0  C0    0
1  A1  B1  C1    1
2  A2  B2  C2    2

In [110]:
rig

    A   B   C  Key
0  A3  B3  C3    0
1  A4  B4  C4    1
2  A5  B5  C5    2

In [112]:
pd.merge(lef,rig,on='Key')

  A_x B_x C_x  Key A_y B_y C_y
0  A0  B0  C0    0  A3  B3  C3
1  A1  B1  C1    1  A4  B4  C4
2  A2  B2  C2    2  A5  B5  C5

In [113]:
df.columns

Index(['A', 'B'], dtype='object')

In [114]:
df.index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]],
           names=['Groups', 'Num'])

In [115]:
lef.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.